package sec1;

public class Example1 {
	public static void main(String[] args) {
		int a = 1004;
		System.out.println("a="+a);
		//변수명의 규칙
		//1. 영문소문자로 시작한다.
		//2. 두 번째 글자부터는 영문, 숫자, $, _ 를 활용할 수 있다.
		//3. 변수명 사이에는 공백을 넣을 수 없다.---> 1,2,3은 꼭 지켜야함.
		//4. 예약어(자바에서 이미 명령문구로 사용하고자하여 정해진 단어, 변수명으로 사용할 수 없음 - 자주색 글자
		//관례(말하지 않아도 상식적으로 지켜야함)
		//변수명은 그 변수에 무엇이 저장되는지 알기 쉽게 하기.
		//만약, 변수명은 그 변수에 무엇이 저장되는지 알기 쉽게 하기 위해 여러 단어로 이루어져 있는 경우가 많다 -> 하나의 긴 단어로 써버리면 읽거나 이해하기 힘들게 되므로
		//ivememberyujin --> ive_member_yujin (언더스코어=스네이크 방식) 이렇게 표시.
		//ivememberyujin --> iveMemberYujin (카멜 방식)
		//자바는 카멜방식 추천, 파이썬이나 c는 언더스코어 방식 추천
	}

}
